# Electrical Setting Remove Wire Material Type Method

Source: https://www.revitapidocs.com/2026/d3193518-abc6-0c64-cbf8-332b04bef8ad.htm

---

| Electrical Setting Remove Wire Material Type Method |
| --- |

**Note: This API is now obsolete.**

Remove the wire material type from project.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("RemoveWireMaterialType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use Document.Delete() instead.")]
public void RemoveWireMaterialType(
	WireMaterialType materialType
)
```

```
<ObsoleteAttribute("RemoveWireMaterialType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use Document.Delete() instead.")>
Public Sub RemoveWireMaterialType (
	materialType As WireMaterialType
)
```

```
public:
[ObsoleteAttribute(L"RemoveWireMaterialType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use Document.Delete() instead.")]
void RemoveWireMaterialType(
	WireMaterialType^ materialType
)
```

```
[<ObsoleteAttribute("RemoveWireMaterialType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use Document.Delete() instead.")>]
member RemoveWireMaterialType :
        materialType : WireMaterialType -> unit
```

#### Parameters

materialType WireMaterialType
:   The wire material type to be removed.

Exceptions

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Wire material type can be removed only if it is not currently assigned to any wire type,  and the last one wire material type can't be removed, otherwise an exception will be thrown. |

See Also

#### Reference

ElectricalSetting Class Autodesk.Revit.DB.Electrical Namespace